{
  "Tamara Maddox": {
    " CS110": [
      {
        "review": "Her lectures are very interactive and she makes an effort to ensure that students are engaged while in class. Be prepared to show up to class every day because there is graded class participation work. She always listens to feedback on grading and her class. She also does a good job of helping freshmen get used to the rigor of college classes.",
        "qualityGrading": 5,
        "difficultyRating": 2,
        "labels": [
          "Participation matters",
          "Gives good feedback",
          "Caring"
        ]
      },
      {
        "review": "Requires attendance through creative activities/puzzles. She keeps the lectures interactive with the students and encourages group participation. There are lots of readings and the midterms are questions directly sourced from your weekly quizzes. Her slides are useful for basic understandings, but you have to read to understand on a deeper level.",
        "qualityGrading": 4,
        "difficultyRating": 2,
        "labels": [
          "Get ready to read",
          "Participation matters",
          "EXTRA CREDIT"
        ]
      },
      {
        "review": "Prof Maddox is a good person and a good instructor. She cares about the students and the classes she teaches, much more than most professors I've had so far. I'm only taking her for 110 but would definitely for the harder CS classes. Attendance is enforced with participation activities every class but this only incentivizes you to show up. 10/10.",
        "qualityGrading": 5,
        "difficultyRating": 2,
        "labels": [
          "Participation matters",
          "Amazing lectures ",
          "Gives good feedback"
        ]
      },
      {
        "review": "Makes us do exercises everyday to force attendance. Very harsh grader. Takes points for the slightest things. Takes points off for a single extra space. DONT TAKE",
        "qualityGrading": 1,
        "difficultyRating": 5,
        "labels": [
          "Tough grader",
          "Get ready to read",
          "Participation matters"
        ]
      }
    ],
    " CS306": [
      {
        "review": "Assumes that her class is the most important class in the world and is the only one you are taking. Gives an unreasonably high amount of reading (around thirty to sixty pages per class) and in-depth quizzes every class. Class discussions are just recapping info from textbook (after the quiz on said info) and homework announced just before due.",
        "qualityGrading": 1,
        "difficultyRating": 5,
        "labels": [
          "Get ready to read",
          "Participation matters",
          "Group projects"
        ]
      },
      {
        "review": "This class was the worst. She makes you read 60+ pages and picks the most specific questions. Even if you read, unless you wrote every little detail, you'll fail. There was not even proper lectures for this course. She doesn't give a midterm and then gives a final with the whole course and more on it, you do not even get quizzes back for reference.",
        "qualityGrading": 2,
        "difficultyRating": 5,
        "labels": [
          "Tough grader",
          "Get ready to read",
          "Participation matters"
        ]
      },
      {
        "review": "She's alright. She gets a 2/5. The class is stupid and has nothing to do with CS. Complete waste of time. Lots of HW. Read that again! Really a lot of HW and group work. Why would a CS student have to learn court systems and do legal research ?! It would be better if this class was combined with 110 and replaced with something useful. ",
        "qualityGrading": 3,
        "difficultyRating": 4,
        "labels": [
          "Tough grader",
          "Get ready to read",
          "Lots of homework"
        ]
      },
      {
        "review": "CS306 is the most idiotic class in this school. I don't understand how they can get anyone to teach this stupid class. you essentially learn nothing, this class is as stupid as gender studies.",
        "qualityGrading": 1,
        "difficultyRating": 2,
        "labels": [
          "Lots of homework",
          "Get ready to read",
          "Participation matters"
        ]
      },
      {
        "review": "Tamara Maddox is not a bad professor, but CS 306 is a bad course. Every CS student has to take it. It becomes annoying especially because the course has almost nothing to do with CS. Nothing substantial happens in lecture except for participation points. First half of semester is FULL of homework. Put your head down and work and you will pass easy!",
        "qualityGrading": 2,
        "difficultyRating": 3,
        "labels": [
          "Lots of homework",
          "Participation matters",
          "Group projects"
        ]
      },
      {
        "review": "She is okay The grading criteria is clear. This class is assignment heavy, so just start early with the big assignments with your group and you'll be straightforward. The quizzes are annoying, but doable. The essays are difficult but you have retake opportunities. This class is doable, just be ready to work more along ur other higher lvl cs classes",
        "qualityGrading": 3,
        "difficultyRating": 4,
        "labels": [
          "Lots of homework",
          "Get ready to read",
          "Participation matters"
        ]
      },
      {
        "review": "This class was pretty straight forward if you did the work. If you got a grade you did not like Maddox was always available to talk about it and even give credit back sometimes. The main complaint was that the lectures about law were asynch so several people struggled (mostly because no one wanted to watch the lecture on their own including myself)",
        "qualityGrading": 5,
        "difficultyRating": 3,
        "labels": [
          "Accessible outside class",
          "Clear grading criteria",
          "Amazing lectures"
        ]
      },
      {
        "review": "Hardest grader ever. Not sure if she thinks she teaching Harvard Law students, she needs to remember that we are CS students. Not law students!!!! Also made me hate everything about learning law.",
        "qualityGrading": 1,
        "difficultyRating": 4,
        "labels": [
          "Get ready to read",
          "Group projects",
          "Tough grader"
        ]
      },
      {
        "review": "Prof. Maddox was a great professor who knew her material do to her professional background in law and CS. However, the CS306 course is just way too much work to complete all of the individual assignments on top of the five-step semeseter-long project. I spent more time in this class than any of my other classes and I took 483, 468, and others.",
        "qualityGrading": 4,
        "difficultyRating": 4,
        "labels": [
          "Lots of homework",
          "Skip class? You won't pass.",
          "Group projects"
        ]
      }
    ],
    " 306": [
      {
        "review": "I think Maddox is a good professor, she's nice and has a lot of passion for the subject she teaches. I just think 306 is poorly structured, and that makes the class as a whole not the most fun, even with a decent professor. As long as you complete readings/assignments and regularly attend class for the quizzes and points, you'll do fine.",
        "qualityGrading": 3,
        "difficultyRating": 4,
        "labels": [
          "Get ready to read",
          "Participation matters",
          "Group projects"
        ]
      },
      {
        "review": "Maddox is a professor who clearly cares about your success in this class. However, the material for this class is equivalent to a high school mock trial elective. Additionally, she creates quizzes out of the material from her own book, which is a required purchase (at least it's only 10% of the grade).... ",
        "qualityGrading": 3,
        "difficultyRating": 5,
        "labels": [
          "Participation matters",
          "Group projects",
          "Gives good feedback"
        ]
      },
      {
        "review": "I loved professor Maddox this semester she is very energetic, makes lectures fun, and even brought us donuts! The class itself is a little boring but since its a requirement I truly do this Maddox is the best option. Skim the readings, look over notes, and do the essays on time and that should prepare you fully for the exams and in class quizzes.",
        "qualityGrading": 5,
        "difficultyRating": 3,
        "labels": [
          "Get ready to read",
          "Clear grading criteria",
          "Accessible outside class"
        ]
      }
    ]
  }
}